<template>
  <div>
    <h2>В планах</h2>
    <ol>
      <li>
        Интегрировать карту от стороннего сервиса, например, Google Maps, Яндекс Карты и т. д.
      </li>
      <li>Добавить больше аналитики, графики.</li>
      <li>
        Протестировать приложение на различных версиях Android. Сейчас оно активно используется на
        версии <i>Android 10</i>.
      </li>
      <li>
        Добавить пользователей. Сейчас приложение можно использовать только для личного учёта.
      </li>
      <li>
        Добавить маршруты. Интересно наблюдать как проезжаешь конкретный маршрут на карте, ставишь
        рекорды.
      </li>
      <li>
        Добавить лучшие рузультаты пользователей на конкретных маршрутах. Устроить соревнования.
      </li>
    </ol>
  </div>
</template>
