<template>
  <main class="content container container-text">
    <h1>Пользовательское соглашение</h1>

    <p>Кратко, <i>Приложение</i> распространяется "как есть", без каких либо гарантий.</p>
    <p>
      Использование <i>Приложения</i> осуществляется <i>Пользователем</i> по своему решению и на
      свой риск при условии, что Пользователь несет исключительную ответственность за любой ущерб,
      причиненный компьютерной системе Пользователю, за потерю данных или иной вред, причиненный в
      результате такой деятельности.
    </p>
    <p>
      Автор оставляет за собой право изменить данное соглашение в будущем и написать портянку текста
      которую <b>никто никогда не прочитает</b> в большинстве случаев.
    </p>
  </main>
</template>
