<script setup>
import PlanBlock from "../PlanBlock.vue"

const screens = [
  { name: "Главный, начало тренировки" },
  { name: "Тренировка, запись маршрута" },
  { name: "Просмотр тренировки, детали, графики" },
  { name: "Список тренировок" },
  { name: "Экспорт тренировок" },
  { name: "Импорт тренировок" },
  { name: "Импорт тренировки вручную" },
  { name: "Статистика" },
  { name: "Статистика за месяц" },
  { name: "Настройки" },
  { name: "Типы тренировок" },
  { name: "Профиль пользователя" },
  { name: "О приложении" },
]
</script>

<template>
  <div>
    <div class="container">
      <h1>Мобильное приложение для учёта тренировок</h1>
    </div>
    <div class="container container-text">
      <p>
        Приложение представляет собой <b>GPS трекер</b>, поэтому может использоваться для различных
        тренировок: бег, ходьба, езда на велосипеде и т. д. Хранит все тренирови на мобильном
        устройстве.
      </p>
      <p>Состоит из экранов, всего {{ screens.length }} шт.</p>
      <ol>
        <li v-for="(screen, i) in screens" :key="i">{{ screen.name }}</li>
      </ol>

      <plan-block />
    </div>
  </div>
</template>
