<script setup></script>

<template>
  <div>
    <div class="container">
      <h1>Мобильное приложение для учёта тренировок</h1>
    </div>
    <div class="container container-text">
      <p>
        Приложение представляет собой <b>GPS трекер</b>, поэтому может использоваться для различных
        тренировок: бег, ходьба, езда на велосипеде и т. д. Хранит все тренирови на мобильном устройстве.
      </p>
      <p>Состоит из одинадцати экранов</p>
      <ol>
        <li>Главный, начало тренировки</li>
        <li>Тренировка, запись маршрута</li>
        <li>Просмотр тренировки, детали, графики</li>
        <li>Список тренировок</li>
        <li>Экспорт тренировок</li>
        <li>Импорт тренировок</li>
        <li>Настройки</li>
        <li>Профиль</li>
        <li>Статистика</li>
        <li>Статистика за месяц</li>
        <li>О приложении</li>
      </ol>

      <p>В планах</p>
      <ul>
        <li>Выпустить beta версию. Сейчас есть костыли и что то не учтено, возможны ошибки.</li>
        <li>
          Добавить сервис хранилища тренировок и синхронизацию с устройствами.
        </li>
        <li>
          Добавить маршруты. Интересно наблюдать как проезжаешь конкретный маршрут на карте, ставишь
          рекорды.
        </li>
        <li>
          Добавить лучшие рузультаты пользователей на конкретных маршрутах. Устроить соревнования.
        </li>
      </ul>
    </div>
  </div>
</template>
