<script setup></script>

<template>
  <div>
    <div class="container">
      <h1>Мобильное приложение для учёта тренировок</h1>
    </div>
    <div class="container container-text">
      <p>
        Приложение представляет собой <b>GPS трекер</b>, поэтому может использоваться для различных
        тренировок: бег, езда на велосипеде и т. д. Хранит все тренирови на мобильном устройстве.
      </p>
      <p>Состоит из семи экранов</p>
      <ol>
        <li>Главный, начало тренировки</li>
        <li>Тренировка</li>
        <li>Просмотр тренировки</li>
        <li>Список тренировок</li>
        <li>Настройки</li>
        <li>Профиль</li>
        <li>О приложении</li>
      </ol>

      <p>В планах</p>
      <ul>
        <li>Выпустить beta версию. Сейчас есть костыли и что то не учтено, возможны ошибки.</li>
        <li>
          Добавить пользователей. Сейчас приложение можно использовать только для личного учёта.
        </li>
        <li>
          Добавить маршруты. Интересно наблюдать как проезжаешь конкретный маршрут на карте, ставишь
          рекорды.
        </li>
        <li>
          Добавить лучшие рузультаты пользователей на конкретных маршрутах. Устроить соревнования.
        </li>
        <li>Добавить серверную часть и синхронизацию с ней.</li>
      </ul>
    </div>
  </div>
</template>
