<script setup>
import { URL_1_4_2_START } from "@/api/ScreenshotApi"

const screens = [
  { name: "Главный, начало тренировки" },
  { name: "Тренировка, запись маршрута" },
  { name: "Просмотр тренировки, детали, графики" },
  { name: "Список тренировок" },
  { name: "Экспорт тренировок" },
  { name: "Импорт тренировок" },
  { name: "Импорт тренировки вручную" },
  { name: "Статистика" },
  { name: "Статистика за месяц" },
  { name: "Настройки" },
  { name: "Типы тренировок" },
  { name: "Профиль пользователя" },
  { name: "О приложении" },
]
</script>

<template>
  <div>
    <h1>Мобильное приложение для учёта тренировок</h1>

    <div class="row">
      <div class="col-sm-6">
        <p>
          Приложение представляет собой <b>GPS трекер</b>, поэтому может использоваться для
          различных тренировок: бег, ходьба, езда на велосипеде и т. д. Хранит все тренирови на
          мобильном устройстве. Не требует интернет.
        </p>
        <p>Приложение разделено на экраны, всего {{ screens.length }} шт.</p>
        <ol>
          <li v-for="(screen, i) in screens" :key="i">{{ screen.name }}</li>
        </ol>
      </div>
      <div class="col-sm-6">
        <div class="image-item mx-auto">
          <img :src="URL_1_4_2_START" class="main-image" />
        </div>
      </div>
    </div>
    <h3>Преимущества</h3>
    <ul>
      <li>
        универсальный GPS трекер, поэтому может использоваться для различных тренировок: бег,
        ходьба, езда на велосипеде
      </li>
      <li>
        тратит немного меньше энергии чем аналоги, так как извлекает местоположение только при
        записи тренировки
      </li>
      <li>все тренировки храняться на мобильном устройстве, быстрая загрузка данных</li>
      <li>не требует интернет, не собирает и не передает конфеденциальную информацию</li>
      <li>не зависит от сервисов, попавших под санкции</li>
      <li>есть восстановление тренировки после сбоя</li>
      <li>редактирование маршрута, можно срезать часть</li>
      <li>добавление тренировки вручную и из архива</li>
      <li>компактный и полный просмотр статистики</li>
      <li>импорт и экспорт тренировок, можно посмотреть что выгружается</li>
      <li>хитрый экспорт тренировок из Strava и Adidas running</li>
      <li>есть документация</li>
    </ul>
    <h3>Разрешения или права</h3>
    <ol>
      <li>
        Доступ к <i>получению местоположения в фоне</i> нужен чтобы записывать маршрут тренировки
        когда телефон находится в неактивном состоянии.
      </li>
      <li>Доступ к <i>точному местоположению</i> нужен чтобы записывать маршрут тренировки.</li>
      <li>
        Доступ к <i>уведомлениям</i> нужен чтобы показывать пользователю важную информацию во время
        записи тренировки.
      </li>
    </ol>
  </div>
</template>

<style>
.main-image {
  max-width: 240px;
}
</style>
