<script setup lang="ts">
const screens = [
  { name: "Главный, начало тренировки" },
  { name: "Тренировка, запись маршрута" },
  { name: "Просмотр тренировки, детали, графики" },
  { name: "Список тренировок" },
  { name: "Экспорт тренировок" },
  { name: "Импорт тренировок" },
  { name: "Добавление тренировки вручную" },
  { name: "Статистика" },
  { name: "Статистика за месяц" },
  { name: "Настройки" },
  { name: "Типы тренировок" },
  { name: "Профиль пользователя" },
  { name: "О приложении" },
]
</script>

<template>
  <div>
    <p>
      Приложение представляет собой <b>GPS трекер</b>, поэтому может использоваться для различных
      тренировок: бег, ходьба, езда на велосипеде и т. д. Хранит все тренирови на мобильном
      устройстве. Может использоваться без интернета.
    </p>
    <p>Приложение разделено на экраны, всего {{ screens.length }} шт.</p>
    <ol>
      <li v-for="(screen, i) in screens" :key="i">{{ screen.name }}</li>
    </ol>
  </div>
</template>
