<script setup lang="ts">
import { URL_START, getImage } from "@/api/ScreenshotApi"

const screens = [
  { name: "Главный, начало тренировки" },
  { name: "Тренировка, запись маршрута" },
  { name: "Просмотр тренировки, детали, графики" },
  { name: "Список тренировок" },
  { name: "Экспорт тренировок" },
  { name: "Импорт тренировок" },
  { name: "Добавление тренировки вручную" },
  { name: "Статистика" },
  { name: "Статистика за месяц" },
  { name: "Настройки" },
  { name: "Типы тренировок" },
  { name: "Профиль пользователя" },
  { name: "О приложении" },
]

const mainScreenshot = getImage(URL_START)
</script>

<template>
  <div>
    <h1>Мобильное приложение для учёта тренировок</h1>

    <div class="row">
      <div class="col-sm-6">
        <p>
          Приложение представляет собой <b>GPS трекер</b>, поэтому может использоваться для
          различных тренировок: бег, ходьба, езда на велосипеде и т. д. Хранит все тренирови на
          мобильном устройстве. Может использоваться без интернета.
        </p>
        <p>Приложение разделено на экраны, всего {{ screens.length }} шт.</p>
        <ol>
          <li v-for="(screen, i) in screens" :key="i">{{ screen.name }}</li>
        </ol>
      </div>
      <div class="col-sm-6">
        <div class="image-box mx-auto">
          <img
            :src="mainScreenshot.url"
            :height="mainScreenshot.height"
            :width="mainScreenshot.width"
            :alt="mainScreenshot.alt"
            class="main-image"
          />
        </div>
      </div>
    </div>
    <h3>Преимущества</h3>
    <ul>
      <li>
        Универсальный <b>GPS трекер</b>, поэтому может использоваться для различных тренировок: бег,
        ходьба, езда на велосипеде
      </li>
      <li>
        Тратит немного меньше энергии чем аналоги, так как извлекает местоположение только при
        записи тренировки
      </li>
      <li>Все тренировки храняться на мобильном устройстве, <b>быстрая загрузка данных</b></li>
      <li>
        Может использоваться <b>без интернета</b>, не собирает и не передает конфеденциальную
        информацию
      </li>
      <li>Не зависит от сервисов, попавших под санкции</li>
      <li>Есть <b>восстановление тренировки</b> после сбоя</li>
      <li>Редактирование маршрута, можно срезать часть</li>
      <li>Добавление тренировки вручную</li>
      <li>Компактный и полный просмотр статистики</li>
      <li><b>Импорт и экспорт</b> тренировок, можно посмотреть что выгружается</li>
      <li>Хитрый экспорт тренировок из <b>Strava</b> и <b>Adidas running</b></li>
      <li>Есть документация</li>
    </ul>
    <h3>Разрешения или права</h3>
    <ol>
      <li>
        Доступ к <i>получению местоположения в фоне</i> нужен чтобы записывать маршрут тренировки
        когда телефон находится в неактивном состоянии.
      </li>
      <li>Доступ к <i>точному местоположению</i> нужен чтобы записывать маршрут тренировки.</li>
      <li>
        Доступ к <i>уведомлениям</i> нужен чтобы показывать пользователю важную информацию во время
        записи тренировки.
      </li>
    </ol>
  </div>
</template>

<style>
.main-image {
  outline: 1px solid #ddd;
}
</style>
